In [ ]:
!pip install selenium

In [90]:
import selenium

In [91]:
import pandas as pd

In [92]:
from selenium import webdriver

In [93]:
import warnings

In [94]:
warnings.filterwarnings('ignore')

In [95]:
from selenium.webdriver.common.by import By

In [96]:
driver = webdriver.Chrome()

In [8]:
# Q1.

In [9]:
#first get the web page https://www.naukri.com/
driver.get('https://www.naukri.com/');

In [10]:
pip install urllib3==1.26.12

Requirement already satisfied: urllib3==1.26.12 in ./.virtualenvs/myvenv/lib/python3.7/site-packages (1.26.12)
Note: you may need to restart the kernel to use updated packages.

In [11]:
#Enter “Data Scientist” in “Skill, Designations, and Companies” field.
designation = driver.find_element(By.CLASS_NAME,"suggestor-input ")
designation.send_keys("Data Scientist")

In [12]:
#The location filter to be used is “Delhi/NCR”.
location = driver.find_element(By.XPATH,"/html/body/div[1]/div[7]/div/div/div[5]/div/div/div/div[1]/div/input")
location.send_keys("Delhi/NCR")

In [13]:
#click the search button.
search = driver.find_element(By.XPATH,"/html/body/div[1]/div[7]/div/div/div[6]")
search.click()

In [14]:
#scrape the job-title, job-location, company name, experience required
job_title = []
job_location = []
company_name = []
experience = []

In [15]:
#scrape the job-title
job_titles = driver.find_elements(By.XPATH,'//div[@class="cust-job-tuple layout-wrapper lay-2 sjw__tuple "]/div/a')
for i in job_titles:
    title=i.text
    job_title.append(title)

In [16]:
#scrape the job_location
job_locations = driver.find_elements(By.XPATH,'//span[@class="locWdth"]')
for i in job_locations:
    location=i.text
    job_location.append(location)

In [17]:
#scrape the company_name
company_names = driver.find_elements(By.XPATH,'//div[@class=" row2"]/span/a[1]')
for i in company_names:
    company=i.text
    company_name.append(company)

In [18]:
#scrape the experience
experiences = driver.find_elements(By.XPATH,'//span[@class="expwdth"]')
for i in experiences:
    exp=i.text
    experience.append(exp)

In [19]:
print(len(job_title),len(job_location),len(company_name),len(experience))

20 20 20 20

In [20]:
import pandas as pd
df = pd.DataFrame({'Title':job_title,'Location':job_location,'Company Name':company_name, 'Experience':experience})
df

,Title,Location,Company Name,Experience
0,"Senior Data Scientist, Reporting","Kolkata, Mumbai, New Delhi, Hyderabad/Secunder...",Coursera,6-7 Yrs
1,"Data Scientist, Marketing","Kolkata, Mumbai, New Delhi, Hyderabad/Secunder...",Coursera,4-6 Yrs
2,Data Scientist,"Kolkata, Mumbai, New Delhi, Hyderabad, Pune, C...",Ford,3-6 Yrs
3,AI Data Scientist,"Kolkata, Mumbai, New Delhi, Hyderabad, Pune, C...",Ford,2-6 Yrs
4,GenAI Data Scientist,"Kolkata, Mumbai, New Delhi, Hyderabad, Pune, C...",Ford,5-6 Yrs
5,Data Scientist,"Mumbai, Hyderabad, Gurugram",Deloitte,3-6 Yrs
6,DS - NLP Expert,"Hyderabad, Telangana, Gurugram, Haryana, Banga...",Genpact,6-11 Yrs
7,Generative AI Data Scientist,"Hyderabad, Gurugram, Bengaluru",Genpact,8-13 Yrs
8,NLP Data Scientist - Real World Data (RWD),"Kolkata, Mumbai, New Delhi, Hyderabad/Secunder...",Agilite Global Solutions,7-8 Yrs
9,Data Analytics-Corporate HR,"Kolkata, Mumbai, New Delhi, Hyderabad/Secunder...",Tata Communications,3-6 Yrs
10,Opportunity For Data Science- Gurugram/Kolkata...,"Hybrid - Kolkata, West Bengal, Gurugram, Benga...",Genpact,8-13 Yrs
11,Data Scientist,"Noida, Bengaluru",Ericsson,5-10 Yrs
12,Data Scientist,"Kolkata, Mumbai, New Delhi, Hyderabad, Pune, C...",Response Informatics,8-9 Yrs
13,SAS Data Scientist,"Delhi / NCR, Mumbai, Bengaluru",Lericon Informatics,2-6 Yrs
14,Data Scientist,"Hybrid - Noida, Uttar Pradesh, Hyderabad, Beng...",HCLTech,10-18 Yrs
15,Sr . Data Scientist / Manager,"Noida, Gurugram, Bengaluru",Novitas Infotech,7-10 Yrs
16,Data Scientist,"Noida, Gurugram, Bengaluru",Novitas Infotech,3-7 Yrs
17,Data Scientist,"Gurugram, Bengaluru",Blackbuck,3-7 Yrs
18,Data Scientist,Noida,Ericsson,3-7 Yrs
19,Lotus Interworks - Data Scientist,"Delhi / NCR, Kolkata, Mumbai, Hyderabad, Pune,...",Lotus Interworks Inc,1-5 Yrs

In [21]:
#scrape the data for the first 10 jobs results you get and create a dataframe of the scraped data.
import pandas as pd
df = pd.DataFrame({'Title':job_title,'Location':job_location,'Company Name':company_name, 'Experience':experience})
df
df_first_10 = df.head(10)
df_first_10

,Title,Location,Company Name,Experience
0,"Senior Data Scientist, Reporting","Kolkata, Mumbai, New Delhi, Hyderabad/Secunder...",Coursera,6-7 Yrs
1,"Data Scientist, Marketing","Kolkata, Mumbai, New Delhi, Hyderabad/Secunder...",Coursera,4-6 Yrs
2,Data Scientist,"Kolkata, Mumbai, New Delhi, Hyderabad, Pune, C...",Ford,3-6 Yrs
3,AI Data Scientist,"Kolkata, Mumbai, New Delhi, Hyderabad, Pune, C...",Ford,2-6 Yrs
4,GenAI Data Scientist,"Kolkata, Mumbai, New Delhi, Hyderabad, Pune, C...",Ford,5-6 Yrs
5,Data Scientist,"Mumbai, Hyderabad, Gurugram",Deloitte,3-6 Yrs
6,DS - NLP Expert,"Hyderabad, Telangana, Gurugram, Haryana, Banga...",Genpact,6-11 Yrs
7,Generative AI Data Scientist,"Hyderabad, Gurugram, Bengaluru",Genpact,8-13 Yrs
8,NLP Data Scientist - Real World Data (RWD),"Kolkata, Mumbai, New Delhi, Hyderabad/Secunder...",Agilite Global Solutions,7-8 Yrs
9,Data Analytics-Corporate HR,"Kolkata, Mumbai, New Delhi, Hyderabad/Secunder...",Tata Communications,3-6 Yrs

In [27]:
#salary filter to be used is “3-6” lakhs
salary = driver.find_element(By.XPATH,"/html/body/div/div/main/div[1]/div[1]/div/div/div[2]/div[5]/div[2]/div[2]/label/p/span[1]")
salary.click()

In [28]:
#The location filter to be used is “Delhi/NCR”
location = driver.find_element(By.XPATH,"/html/body/div/div/main/div[1]/div[1]/div/div/div[2]/div[13]/div[2]/div[1]/label/p/span[1]")
location.click()

In [ ]:
#Q2.

In [34]:
#get url
driver.get('https://www.shine.com/');

In [42]:
#Data Analyst” in “Job title, Skills” field 
job_title = driver.find_element(By.XPATH,"/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[1]/ul/li[1]/div/input")
job_title.send_keys("Data Analyst")

In [39]:
#“Bangalore” in “enter the location” field.
job_loc = driver.find_element(By.XPATH,"/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[1]/ul/li[2]/div/input")
job_loc.send_keys("Bangalore")

In [43]:
#click search button
search_btn = driver.find_element(By.XPATH,"/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[2]/div/button")
search_btn.click()

In [44]:
#scrape the job-title, job-location, company name, experience required
job_title = []
job_location = []
company_name = []
experience = []

In [47]:
#scrape the job-title
job_titles = driver.find_elements(By.XPATH,'//div[@class="jobCard_jobCard__jjUmu  white-box-border jobCard"]/div/h2/a')
for i in job_titles:
    title=i.text
    job_title.append(title)

In [49]:
#scrape the job_location
job_locations = driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_locationIcon__zrWt2"]')
for i in job_locations:
    location=i.text
    job_location.append(location)

In [50]:
#scrape the company_name
company_names = driver.find_elements(By.XPATH,'//div[@class="jobCard_jobCard_cName__mYnow"]')
for i in company_names:
    company=i.text
    company_name.append(company)

In [51]:
#scrape the experience
experiences = driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_jobIcon__3FB1t"]')
for i in experiences:
    exp=i.text
    experience.append(exp)

In [52]:
print(len(job_title),len(job_location),len(company_name),len(experience))

20 20 20 20

In [54]:
#scrape the data for the first 10 jobs results you get and create a dataframe of the scraped data.

import pandas as pd
df = pd.DataFrame({'Title':job_title,'Location':job_location,'Company Name':company_name, 'Experience':experience})
df
df_first_10 = df.head(10)
df_first_10

,Title,Location,Company Name,Experience
0,Data Analyst,Bangalore\n+9,sahast sales corporation,12 to 22 Yrs
1,Clinical Data Analyst,Bangalore\n+6,techno endura,0 to 1 Yr
2,Data Analyst,Bangalore\n+9,sahast sales corporation,12 to 22 Yrs
3,Hiring For Data Analyst,Bangalore\n+12,radhika enterprises,0 to 4 Yrs
4,Clinical Data Analyst,Bangalore\n+6,techno endura,0 to 1 Yr
5,Lead Data Analyst,Bangalore,ara resources private limited,4 to 9 Yrs
6,Data Executive karnataka,Bangalore\n+9,v-tech data outsourcing,0 to 1 Yr
7,Data Analyst,Bangalore\n+3,diraa hr services hiring for mncs,0 to 1 Yr
8,Sas Programmer Analyst,Bangalore\n+8,techno endura,0 to 2 Yrs
9,Part-time remote opportunity document verifica...,Bangalore\n+9,fondstaff private limited,0 to 4 Yrs

In [ ]:
#Q3

In [56]:
#first get the web page
driver.get('https://www.flipkart.com/apple-iphone-11-black-64-gb/product-reviews/itm4e5041ba101fd?pid=MOBFWQ6BXGJCEYNY&lid=LSTMOBFWQ6BXGJCEYNYZXSHRJ&marketplace=FLIPKART');

In [80]:
#Rating
rating = []
ratings = driver.find_elements(By.XPATH,'//div[@class="_3LWZlK _1BLPMq"]')
for i in ratings[:100]:
    ratin=i.text
    rating.append(ratin)

In [81]:
print(len(rating))

10

In [82]:
#Review Summary
reviewSum = []
reviewSummary = driver.find_elements(By.XPATH,'//p[@class="_2-N8zT"]')
for i in reviewSummary[:100]:
    rvs=i.text
    reviewSum.append(rvs)

In [83]:
print(len(reviewSum))

10

In [84]:
#Review 
reviewFull = []
review_Full = driver.find_elements(By.XPATH,'//div[@class="t-ZTKy"]/div/div')
for i in review_Full[:100]:
    rvf=i.text
    reviewFull.append(rvf)

In [85]:
print(len(reviewFull))

10

In [86]:
import pandas as pd
df = pd.DataFrame({'Rating':rating,'Review_Summary':reviewSum,'Review':reviewFull})
df
df_first_100 = df.head(100)
df_first_100

,Rating,Review_Summary,Review
0,5,Must buy!,It’s really awesome
1,5,Brilliant,Excellent Phone.
2,5,Awesome,iPhone 11 is a good phone. Not a very big diff...
3,5,Excellent,NYC
4,5,Perfect product!,V Good all
5,5,Super!,Good product 👌I love iPhone
6,5,Fabulous!,It’s very good battery life and display and vi...
7,5,Terrific purchase,Value for money 🖤🖤
8,5,Must buy!,"Go for iPhone 11 , if confused between iPhone ..."
9,5,Highly recommended,Awesome Battery Life...Camera clarity is too g...

In [ ]:
#Q4

In [98]:
driver.get('https://www.flipkart.com');

In [100]:
search_btn = driver.find_element(By.CLASS_NAME,"Pke_EE")
search_btn.send_keys("sneakers")

In [107]:
search_icon = driver.find_element(By.XPATH,"/html/body/div[1]/div/div[1]/div/div/div/div/div[1]/div/div[1]/div/div[1]/div[1]/header/div[1]/div[2]/form/div/button")
search_icon.click()

In [ ]:
#scraping data for 35 inorder to make the arrays equal size. Every arrays have common size of 35 so took 35.

In [141]:
#brand
brand = []
brands = driver.find_elements(By.XPATH,'//div[@class="_2WkVRV"]')
for i in brands[:35]:
    br=i.text
    brand.append(br)

In [142]:
print(len(brand))

35

In [ ]:

page_count = driver.find_element(By.XPATH,"/html/body/div/div/div[3]/div[1]/div[2]/div[12]/div/div/nav/a[2]")
page_count.click()

In [129]:
#product Description
prod_desc = []
prod_descr = driver.find_elements(By.XPATH,'//a[@class="IRpwTa"]')
for i in prod_descr:
    pd=i.text
    prod_desc.append(pd)

In [131]:
print(len(prod_desc))

35

In [139]:
#price
price = []
prices = driver.find_elements(By.XPATH,'//div[@class="_30jeq3"]')
for i in prices[:35]:
    pr=i.text
    price.append(pr)

In [140]:
print(len(price))

35

In [143]:
import pandas as pd
df = pd.DataFrame({'brand':brand,'prod_desc':prod_desc,'price':price})
df
df_first_35 = df.head(35)
df_first_35

          brand                                          prod_desc   price
0        BRUTON           Exclusive Sneaker Shoes Sneakers For Men    ₹296
1        BRUTON               Modern Trendy Shoes Sneakers For Men    ₹294
2     Deals4you                                 Sneakers For Women    ₹439
3      URBANBOX  Trending Stylish Casual Outdoor Shoes Sneakers...    ₹299
4      RED TAPE  Casual Sneakers Shoes for Men | Soft Cushioned...  ₹1,179
5          PUMA             2 Combo Sneaker Shoes Sneakers For Men  ₹1,047
6        BRUTON     Trendy & Stylish Casual Shoes Sneakers For Men    ₹499
7   kardam&sons  Premium Casual Shoes for Women Sneakers For Women    ₹429
8       A-CLASS      Combo Pack Of 2 Casual Shoes Sneakers For Men    ₹499
9         BIRDE                                 Sneakers For Women    ₹299
10       BRUTON  Sneaker Casual Shoes For Men | Soft Cushion In...    ₹499
11    Deals4you  Casual Sneakers Shoes for Men | Soft Cushioned...    ₹374
12     RED TAPE              mzzideko sports shoe Sneakers For Men  ₹1,079
13     RED TAPE  Casual Sneakers ColourFul Block Shoes For Boys...  ₹1,179
14     Mzzideko      Combo Pack Of 2 Casual Shoes Sneakers For Men    ₹489
15       Labbin      Combo Pack Of 2 Casual Shoes Sneakers For Men    ₹539
16       BRUTON  Synthetic Leather |Lightweight|Comfort|Summer|...    ₹499
17       BRUTON                                   Sneakers For Men    ₹499
18         aadi      Modern Trendy Sneakers Shoes Sneakers For Men    ₹299
19          TRM  Casual Sneakers White Shoes For Girls And Snea...    ₹699
20       BRUTON      Combo Pack of 2 Casual Shoes Sneakers For Men    ₹494
21       Layasa  Premium Men Casual Shoes For Men Pack Of 2 Sne...    ₹449
22        BIRDE                                   Sneakers For Men    ₹544
23        BIRDE  Boston-01 Chunky Sneakers,Loafers,Walking Shoe...    ₹549
24   HIGHLANDER  Combo Pack Of 4 Casual Shoes Loafer Shoes Snea...    ₹529
25        asian                                 Sneakers For Women    ₹769
26       BRUTON     Trendy & Stylish Casual Shoes Sneakers For Men    ₹599
27       Layasa  GROOVY Mid-Top Casual Chunky Streetwear Fashio...    ₹449
28     BERSACHE                                 Sneakers For Women    ₹499
29      A-CLASS  Premium Casual Shoes for Women Sneakers For Women    ₹522
30       Kraasa  Trendy & Stylish Casual Shoes Slip On Sneakers...    ₹449
31       Layasa                                 Sneakers For Women    ₹291
32    Ego by NS  Sneakers For Mens/Sandals for mens Slip On Loa...  ₹1,381
33         PUMA  Carnival-02 Mens High Top Casual Chunky Sneake...    ₹299
34        BIRDE                           Seattle Sneakers For Men    ₹499

In [ ]:
#Q5

In [144]:
#Go to webpage
driver.get('https://www.amazon.in');

In [147]:
#SEARCH
search_btn = driver.find_element(By.XPATH,"/html/body/div[1]/header/div/div[1]/div[2]/div/form/div[2]/div[1]/input")
search_btn.send_keys("Laptop")
#search click
search_icon = driver.find_element(By.XPATH,"/html/body/div[1]/header/div/div[1]/div[2]/div/form/div[3]/div/span/input")
search_icon.click()

In [148]:
#Filter CPU Type to “Intel Core i7”
cpuType = driver.find_element(By.XPATH,"/html/body/div[1]/div[1]/div[1]/div[2]/div/div[3]/span/div[1]/div/div/div[6]/ul[19]/span/span[9]/li/span/a/div/label/i")
cpuType.click()

In [149]:
#title
title = []
titles = driver.find_elements(By.XPATH,'//h2[@class="a-size-mini a-spacing-none a-color-base s-line-clamp-2"]')
for i in titles[:10]:
    t=i.text
    title.append(t)

In [154]:
#Ratings
rating = []
ratings = driver.find_elements(By.XPATH,'//span[@class="a-size-base s-underline-text"]')
for i in ratings[:10]:
    r=i.text
    rating.append(r)

In [155]:
print(len(rating))

10

In [151]:
#price
price = []
prices = driver.find_elements(By.XPATH,'//span[@class="a-price-whole"]')
for i in prices[:10]:
    pr=i.text
    price.append(pr)

In [156]:
#scrape data for 10 laptops
import pandas as pd
df = pd.DataFrame({'Title':title,'Ratings':rating,'price':price})
df
df_first_10 = df.head(10)
df_first_10

                                               Title Ratings     price
0  Lenovo IdeaPad Slim 3 Intel Core i7 12th Gen 1...     459    59,990
1  MSI Modern 14, Intel 12th Gen. i7-1255U, 36CM ...      88    49,990
2  HP Pavilion X360 11th Gen Intel Core i7 14" (3...     146    62,490
3  MSI Modern 14, Intel 12th Gen. i7-1255U, 36CM ...      88    49,990
4  Lenovo IdeaPad Slim 3 Intel Core i7 12th Gen 1...     459    66,990
5  Acer Travelmate Business Laptop Intel Core i7-...       4    49,990
6  ASUS TUF Gaming F15, 15.6"(39.62 cms) FHD 144H...       2    62,490
7  HP Laptop 15s, 12th Gen Intel Core i7-1255U, 1...     229  1,19,990
8  ASUS Vivobook 15, Intel Core i7-12650H 12th Ge...      49    49,990
9  HP Pavilion 14 12th Gen Intel Core i7 16GB SDR...     450    74,990

In [ ]:
#Q7

In [157]:
#Go to webpage
driver.get('https://www.azquotes.com/');

In [158]:
#click on Top Quote
top_quote = driver.find_element(By.XPATH,"/html/body/div[1]/div[1]/div[1]/div/div[3]/ul/li[5]/a")
top_quote.click()

In [160]:
#scrap quote, author, type of quote
#quote
quote = []
quotes = driver.find_elements(By.XPATH,'//a[@class="title"]')
for i in quotes:
    q=i.text
    quote.append(q)
#author
author = []
authors = driver.find_elements(By.XPATH,'//div[@class="author"]')
for i in authors:
    a=i.text
    author.append(a)
#quote_type
quote_type = []
quote_types = driver.find_elements(By.XPATH,'//div[@class="tags"]')
for i in quote_types:
    qt=i.text
    quote_type.append(qt)

In [162]:
#scrape data for top 100 quotes
import pandas as pd
df = pd.DataFrame({'Quote':quote,'Author':author,'QuoteType':quote_type})
df
df_first_100 = df.head(100)
df_first_100

,Quote,Author,QuoteType
0,The essence of strategy is choosing what not t...,Michael Porter,"Essence, Deep Thought, Transcendentalism"
1,One cannot and must not try to erase the past ...,Golda Meir,"Inspiration, Past, Trying"
2,Patriotism means to stand by the country. It d...,Theodore Roosevelt,"Country, Peace, War"
3,Death is something inevitable. When a man has ...,Nelson Mandela,"Inspirational, Motivational, Death"
4,You have to love a nation that celebrates its ...,Erma Bombeck,"4th Of July, Food, Patriotic"
...,...,...,...
95,"When the going gets weird, the weird turn pro.",Hunter S. Thompson,"Music, Sports, Hunting"
96,When a train goes through a tunnel and it gets...,Corrie Ten Boom,"Trust, Encouraging, Uplifting"
97,If you think you are too small to make a diffe...,Dalai Lama,"Inspirational, Funny, Change"
98,"God doesn't require us to succeed, he only req...",Mother Teresa,"Success, God, Mother"
99,Change your thoughts and you change your world.,Norman Vincent Peale,"Inspirational, Motivational, Change"

In [ ]:
#Q7

In [163]:
#Go to webpage
driver.get('https://www.jagranjosh.com/general-knowledge/list-of-all-prime-ministers-of-india-1473165149-1');

In [165]:
#scrap Name, Born-Dead, Term of office, Remarks
#Name
name = []
names = driver.find_elements(By.XPATH,'//div[@class="TableData"]/table/tbody/tr/td[2]/div')
for i in names:
    n=i.text
    name.append(n)
#Born-Dead
born_dead = []
born_deads = driver.find_elements(By.XPATH,'//div[@class="TableData"]/table/tbody/tr/td[3]/div')
for i in born_deads:
    bd=i.text
    born_dead.append(bd)
#Term of office
term_of_office = []
terms_of_office = driver.find_elements(By.XPATH,'//div[@class="TableData"]/table/tbody/tr/td[4]/div[1]')
for i in terms_of_office:
    tof=i.text
    term_of_office.append(tof)
#Remarks
remarks = []
remark = driver.find_elements(By.XPATH,'//div[@class="TableData"]/table/tbody/tr/td[5]/div')
for i in remark:
    rm=i.text
    remarks.append(rm)

In [168]:
#scrape data to display list of respected former Prime Ministers of India 
import pandas as pd
df = pd.DataFrame({'Name':name,'Born-Dead':born_dead,'Term of office':term_of_office,'Remarks':remarks})
df
df_first_20 = df.head()
df_first_20

,Name,Born-Dead,Term of office,Remarks
0,Jawahar Lal Nehru,(1889–1964),15 August 1947 to 27 May 1964,The first prime minister of India and the long...
1,Gulzarilal Nanda (Acting),(1898-1998),"27 May 1964 to 9 June 1964,",First acting PM of India
2,Lal Bahadur Shastri,(1904–1966),9 June 1964 to 11 January 1966,He has given the slogan of 'Jai Jawan Jai Kisa...
3,Gulzari Lal Nanda (Acting),(1898-1998),11 January 1966 to 24 January 1966,-
4,Indira Gandhi,(1917–1984),24 January 1966 to 24 March 1977,First female Prime Minister of India

In [ ]:
#Q8

In [169]:
#Go to webpage
driver.get('https://www.motor1.com/');

In [171]:
#SEARCH
search_btn = driver.find_element(By.XPATH,"/html/body/div[9]/div[2]/div/div/div[3]/div/div/div/form/input")
search_btn.send_keys("50 most expensive cars")
#there is no search results for these

In [172]:
#search click
search_icon = driver.find_element(By.XPATH,"/html/body/div[9]/div[2]/div/div/div[3]/div/div/div/form/button[1]")
search_icon.click()